VDowbensky/LoRa-platform/FW/usb_sigle_virtual_com_slave_v0.2/common/hc32l176.h
typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pe11_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pe12_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pe13_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pe14_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pe15_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf00_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf01_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf02_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf03_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf04_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf05_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf06_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf07_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf08_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf09_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf10_sel_field_t;

typedef struct
{
    __IO uint32_t SEL                       : 3;
} stc_gpio_pf11_sel_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pedir_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pein_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_peout_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_peads_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pebset_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pebclr_field_t;

typedef struct
{
    __IO uint32_t PEBCLR                    :16;
    __IO uint32_t PEBSET                    :16;
} stc_gpio_pebsetclr_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pedr_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pepu_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pepd_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_peod_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pehie_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pelie_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_perie_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pefie_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfdir_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfin_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfout_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfads_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfbset_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfbclr_field_t;

typedef struct
{
    __IO uint32_t PFBCLR                    :12;
    uint32_t RESERVED12                     : 4;
    __IO uint32_t PFBSET                    :12;
} stc_gpio_pfbsetclr_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfdr_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfpu_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfpd_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfod_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfhie_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pflie_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pfrie_field_t;

typedef struct
{
    __IO uint32_t PF00                      : 1;
    __IO uint32_t PF01                      : 1;
    __IO uint32_t PF02                      : 1;
    __IO uint32_t PF03                      : 1;
    __IO uint32_t PF04                      : 1;
    __IO uint32_t PF05                      : 1;
    __IO uint32_t PF06                      : 1;
    __IO uint32_t PF07                      : 1;
    __IO uint32_t PF08                      : 1;
    __IO uint32_t PF09                      : 1;
    __IO uint32_t PF10                      : 1;
    __IO uint32_t PF11                      : 1;
} stc_gpio_pffie_field_t;

typedef struct
{
    __IO uint32_t PE00                      : 1;
    __IO uint32_t PE01                      : 1;
    __IO uint32_t PE02                      : 1;
    __IO uint32_t PE03                      : 1;
    __IO uint32_t PE04                      : 1;
    __IO uint32_t PE05                      : 1;
    __IO uint32_t PE06                      : 1;
    __IO uint32_t PE07                      : 1;
    __IO uint32_t PE08                      : 1;
    __IO uint32_t PE09                      : 1;
    __IO uint32_t PE10                      : 1;
    __IO uint32_t PE11                      : 1;
    __IO uint32_t PE12                      : 1;
    __IO uint32_t PE13                      : 1;
    __IO uint32_t PE14                      : 1;
    __IO uint32_t PE15                      : 1;
} stc_gpio_pe_stat_field_t;

